000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/ОбъектУчтенВNavision/ОбъектУчтенВNavision.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОбъектУчтенВNavision</name>
  <resources>
    <name>ВидПередачи</name>
    <type>
      <types>EnumRef.ВидыПередачиNavision</types>
    </type>
  </resources>
  <resources>
    <name>ИмяОбъекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>УчтеноNavision</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОтменаТребуется</name>
    <comment>Команда из КСУ - отменить документ!</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОтменаАкцептована</name>
    <comment>Отмена действия акцептована в периферии</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОтменаНевозможна</name>
    <comment>Документ уже поступил в обработку или обработан</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КассовыйДень</name>
    <comment>Используется при выгрузке продаж за день (Кассовый День)</comment>
    <type>
      <types>DocumentRef.КассовыйДень</types>
    </type>
  </resources>
  <resources>
    <name>ВерсияОбъекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДатаОбновления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРегистрации</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Сообщение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>512</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УведомитьNavision</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DocumentRef.РеализацияТоваров</types>
      <types>DocumentRef.ВозвратТоваровПоставщику</types>
      <types>DocumentRef.ПоступлениеТоваров</types>
      <types>DocumentRef.КорректировкаПеремещения</types>
      <types>DocumentRef.ПриходныйКассовыйОрдер</types>
      <types>DocumentRef.ЗарплатаКВыплатеОрганизаций</types>
      <types>DocumentRef.ПереоценкаТоваровНаСкладах</types>
      <types>DocumentRef.РегистрацияПодсчетаПосетителей</types>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>DocumentRef.ВозвратТоваровОтПокупателя</types>
      <types>DocumentRef.РасходныйКассовыйОрдер</types>
      <types>DocumentRef.ПриказНаПроведениеИнвентаризацииТоваров</types>
      <types>DocumentRef.КассоваяСмена</types>
      <types>DocumentRef.НачислениеИСписаниеБонусныхБаллов</types>
      <types>DocumentRef.ПрименениеЦенНоменклатуры</types>
      <types>DocumentRef.СписаниеТоваров</types>
      <types>DocumentRef.ПересчетТоваровСамостоятельный</types>
      <types>DocumentRef.ОприходованиеТоваров</types>
      <types>DocumentRef.ОтчетОРозничныхПродажах</types>
      <types>DocumentRef.ЗаявкаНаРасходованиеДенежныхСредств</types>
      <types>DocumentRef.ПеремещениеТоваров</types>
      <types>DocumentRef.РегистрацияБезналичнойОплаты</types>
      <types>DocumentRef.ОплатаОтПокупателяПлатежнойКартой</types>
      <types>DocumentRef.ЗаказНаПеремещение</types>
      <types>DocumentRef.ОрдерНаПеремещениеТоваров</types>
      <types>DocumentRef.РасходныйОрдерНаТовары</types>
      <types>DocumentRef.УстановкаЦенНоменклатуры</types>
      <types>DocumentRef.КорректировкаРегистров</types>
      <types>DocumentRef.ПриходныйОрдерНаТовары</types>
      <types>DocumentRef.ПересортицаТоваров</types>
      <types>DocumentRef.КассовыйДень</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Магазин</name>
    <comment>Ресурс предназначен для фильтрации в правилах регистрации</comment>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/ОповещенияКонтрагентов/ОповещенияКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОповещенияКонтрагентов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>НомерТелефона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПрограммаЛояльности</name>
    <type>
      <types>CatalogRef.ПрограммыЛояльности</types>
    </type>
  </resources>
  <resources>
    <name>ДатаАннуляции</name>
    <comment>заполняется, если вид сообщения - &quot;Аннуляция&quot;</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Сообщение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>512</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Хранилище</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидОповещения</name>
    <type>
      <types>EnumRef.ВидыОповещений</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

000_РОЗНИЦА_ЦЕНТР/src/AccumulationRegisters/БонусныеБаллы/БонусныеБаллы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>БонусныеБаллы</name>
  <comment>Основной раздел учёта системы бонусных накоплений</comment>
  <resources>
    <name>СуммаБонусныхБаллов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Авария</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийБонусныхБаллов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОперации</name>
    <comment>Дата регистратора</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОперации</name>
    <type>
      <types>DocumentRef.РеализацияТоваров</types>
      <types>DocumentRef.ЧекККМ</types>
      <types>DocumentRef.ВозвратТоваровОтПокупателя</types>
      <types>DocumentRef.ЗаказПокупателя</types>
      <types>DocumentRef.НачислениеИСписаниеБонусныхБаллов</types>
    </type>
  </attributes>
  <attributes>
    <name>Перенос_ДокументНачисления</name>
    <type>
      <types>DocumentRef.РеализацияТоваров</types>
      <types>DocumentRef.ЧекККМ</types>
      <types>DocumentRef.ЗаказПокупателя</types>
      <types>DocumentRef.НачислениеИСписаниеБонусныхБаллов</types>
    </type>
  </attributes>
  <attributes>
    <name>Перенос_ПрограммаЛояльности</name>
    <type>
      <types>CatalogRef.ПрограммыЛояльности</types>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>70</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СписаниеПартий</name>
    <comment>(Служ.)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаБонусныхБалловОригинал</name>
    <comment>Сумма до изменения при списании</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПрограммаЛояльности</name>
    <type>
      <types>CatalogRef.ПрограммыЛояльности</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументНачисления</name>
    <type>
      <types>DocumentRef.РеализацияТоваров</types>
      <types>DocumentRef.ЧекККМ</types>
      <types>DocumentRef.ЗаказПокупателя</types>
      <types>DocumentRef.НачислениеИСписаниеБонусныхБаллов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

000_РОЗНИЦА_ЦЕНТР/src/AccumulationRegisters/БонусныеБаллыПоЗаказамПокупателей/БонусныеБаллыПоЗаказамПокупателей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>БонусныеБаллыПоЗаказамПокупателей</name>
  <comment>Резервирование интернет-магазина</comment>
  <resources>
    <name>СуммаБонусныхБаллов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаказПокупателя</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПрограммаЛояльности</name>
    <type>
      <types>CatalogRef.ПрограммыЛояльности</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

000_РОЗНИЦА_ЦЕНТР/src/Enums/ВидыОперацийНачислениеИСписаниеБонусныхБаллов/ВидыОперацийНачислениеИСписаниеБонусныхБаллов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийНачислениеИСписаниеБонусныхБаллов</name>
  <enumValues>
    <name>ОперационныйДокумент</name>
  </enumValues>
  <enumValues>
    <name>ПередачаНаБлаготворительныйФонд</name>
  </enumValues>
</mdclass:Enum>

000_РОЗНИЦА_ЦЕНТР/src/Enums/ВидыПередачиNavision/ВидыПередачиNavision.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыПередачиNavision</name>
  <comment>Виды передачи в/из Navision</comment>
  <enumValues>
    <name>ПереданВNavision</name>
    <comment>Объект и блокирован в Рознице и синхронизирован в Navision</comment>
  </enumValues>
  <enumValues>
    <name>ПолученИзNavision</name>
    <comment>Объект является внешним, то есть полученным из Navision.</comment>
  </enumValues>
  <enumValues>
    <name>ТолькоБлокирован</name>
    <comment>Объект не требует синхронизации с Navision</comment>
  </enumValues>
</mdclass:Enum>

000_РОЗНИЦА_ЦЕНТР/src/Enums/ТипыБонусов/ТипыБонусов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыБонусов</name>
  <enumValues>
    <name>Органический</name>
  </enumValues>
  <enumValues>
    <name>Акционный</name>
  </enumValues>
  <enumValues>
    <name>Привлечение</name>
  </enumValues>
</mdclass:Enum>

000_РОЗНИЦА_ЦЕНТР/src/Enums/ВидыОповещений/ВидыОповещений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОповещений</name>
  <enumValues>
    <name>Аннуляция</name>
  </enumValues>
  <enumValues>
    <name>ПередачаБонусов</name>
  </enumValues>
</mdclass:Enum>

000_РОЗНИЦА_ЦЕНТР/src/Enums/ВидыОперацийБонусныхБаллов/ВидыОперацийБонусныхБаллов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийБонусныхБаллов</name>
  <enumValues>
    <name>Начисление</name>
  </enumValues>
  <enumValues>
    <name>Использование</name>
  </enumValues>
  <enumValues>
    <name>Возврат</name>
  </enumValues>
  <enumValues>
    <name>Аннуляция</name>
  </enumValues>
  <enumValues>
    <name>Резерв</name>
  </enumValues>
  <enumValues>
    <name>Реставрация</name>
    <comment>Компенсация &quot;подаренных&quot; сумм</comment>
  </enumValues>
</mdclass:Enum>

000_РОЗНИЦА_ЦЕНТР/src/Documents/НачислениеИСписаниеБонусныхБаллов/НачислениеИСписаниеБонусныхБаллов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>НачислениеИСписаниеБонусныхБаллов</name>
  <registerRecords>AccumulationRegister.БонусныеБаллыПогашение</registerRecords>
  <registerRecords>AccumulationRegister.БонусныеБаллы</registerRecords>
  <registerRecords>AccumulationRegister.БонусныеБаллыВРезерве</registerRecords>
  <registerRecords>InformationRegister.СписанныеБонусныеБаллы</registerRecords>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийНачислениеИСписаниеБонусныхБаллов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияСрокаДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодБюджета</name>
    <type>
      <types>CatalogRef.КодыБюджетов</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПериодовДействия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПериодовОтсрочкиНачалаДействия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Магазин</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодДействия</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодОтсрочкиНачалаДействия</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрограммаЛояльности</name>
    <type>
      <types>CatalogRef.ПрограммыЛояльности</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Начисление</name>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаБонусныхБаллов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Списание</name>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаБонусныхБаллов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КонтрагентПолучатель</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

000_РОЗНИЦА_ЦЕНТР/src/CommonModules/БонусныеБаллыСобытия/Module.bsl
#Область ПрограммныйИнтерфейс

//	LNK 30.09.2021 05:10:00 - РегламентныеЗадание.ВосстановлениеПоследовательностиБонуснойСистемы
Процедура ВосстановлениеПоследовательностиБонуснойСистемы(КоличествоЗаданий, РазмерПакета, ВыполнитьОбщуюКорректировку = Ложь) Экспорт

	УстановитьПривилегированныйРежим(Истина);

	Если ВыполнитьОбщуюКорректировку = Истина Тогда	//	LNK 30.05.2024 09:11:18

		БонусныеБаллыПоследовательность.ВыполнитьКорректировкуПоследовательности();	//	регламентом каждый раз проверяем!

	КонецЕсли;

	КоличествоЗаданий  = ?(ТипЗнч(КоличествоЗаданий) = Тип("Число"), Макс(1, КоличествоЗаданий), 10);
	СписокКонтрагентов = БонусныеБаллыПоследовательность.ПроверитьНеобходимостьВосстановления(Неопределено);

	Если НЕ СписокКонтрагентов.Количество() = 0 Тогда

		РазмерПакета	= Макс(1, Мин(200, РазмерПакета));
		СписокПакета	= Новый Массив;
		СчетчикЗапусков	= 0;
		НомерЗадания	= 0;

		Для Счётчик = 1 По СписокКонтрагентов.Количество() Цикл

			Если СчетчикЗапусков >= КоличествоЗаданий Тогда

				Прервать;

			КонецЕсли;

			СписокПакета.Добавить(СписокКонтрагентов[Счётчик - 1]);

			Если СписокПакета.Количество() = РазмерПакета ИЛИ Счётчик = СписокКонтрагентов.Количество() Тогда

				ПараметрыЗадания = Новый Массив;
				ПараметрыЗадания.Добавить(СписокПакета);
				ПараметрыЗадания.Добавить(Ложь);
				ПараметрыЗадания.Добавить(Ложь);
				ПараметрыЗадания.Добавить(Ложь);

				НомерЗадания = НомерЗадания + 1;
				КлючЗадания	 = "RESEQUENCING_" + Формат(НомерЗадания, "ЧЦ=5; ЧДЦ=; ЧВН=; ЧГ=");

				ФоновыеЗадания.Выполнить("БонусныеБаллыПоследовательность.ВыполнитьВосстановлениеПоследовательности", ПараметрыЗадания, КлючЗадания);

				СписокПакета	= Новый Массив;
				СчетчикЗапусков	= СчетчикЗапусков + 1;

			КонецЕсли;

		КонецЦикла;

	КонецЕсли;

КонецПроцедуры

//	LNK 28.09.2023 07:11:57
Процедура УчестьNAV_НачислениеИСписаниеБонусныхБаллов_НаФонды()	Экспорт

	Если НЕ ПривилегированныйРежим() Тогда

		УстановитьПривилегированныйРежим(Истина);

	КонецЕсли;

	Если НЕ ОбменДаннымиПовтИсп.ЭтоГлавныйУзел() Тогда

		ВызватьИсключение "Процедура призначена для роботи у центральному вузлі.";

	КонецЕсли;

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ТаблицаДокумента.Дата КАК Период,
	|	ТаблицаДокумента.Ссылка КАК Регистратор
	|ИЗ
	|	Документ.НачислениеИСписаниеБонусныхБаллов КАК ТаблицаДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОбъектУчтенВNavision КАК ТаблицаУчтен
	|		ПО ТаблицаДокумента.Ссылка = ТаблицаУчтен.Объект
	|ГДЕ
	|	ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийНачислениеИСписаниеБонусныхБаллов.ПередачаНаБлаготворительныйФонд)
	|	И ТаблицаДокумента.Проведен
	|	И ТаблицаУчтен.Объект ЕСТЬ NULL
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период,
	|	Регистратор"
	);

	РезультатЗапроса = Запрос.Выполнить();

	Если НЕ РезультатЗапроса.Пустой() Тогда

		Выборка = РезультатЗапроса.Выбрать();

		Пока Выборка.Следующий() Цикл

			ВнешниеИсточникиСобытия.УстановитьПереданоNavision(Выборка.Регистратор, ОбщегоНазначенияРТСервер.ПолучитьМагазиныПоОбъекту(Выборка.Регистратор)
				, Перечисления.ВидыПередачиNavision.ПереданВNavision,,,, Истина);

		КонецЦикла;

	КонецЕсли;

КонецПроцедуры

//	LNK 11.10.2022 06:01:15
Процедура ВыполнитьОбщуюПроцедуруОповещенияАннуляции(Отладка = Ложь)	Экспорт

	Если НЕ ПривилегированныйРежим() Тогда

		УстановитьПривилегированныйРежим(Истина);

	КонецЕсли;

	Если ОбменДаннымиПовтИсп.ЭтоГлавныйУзел() Тогда

		УчетнаяПолитика = ОбщегоНазначенияРТповтИсп.ПолучитьУчетнуюПолитику();

		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&ТекущаяДата, ДЕНЬ), ДЕНЬ, &ГлубинаОповещения) КАК ДатаАннуляции"
		);
		Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
		Запрос.УстановитьПараметр("ГлубинаОповещения", УчетнаяПолитика.ГлубинаОповещенияОбАннуляцииБонусныхБаллов);

		Выборка = Запрос.Выполнить().Выбрать();
		Выборка.Следующий();

		РезультатЗапроса = ВыборкаАбонентовОповещения(Выборка.ДатаАннуляции);

		Если НЕ РезультатЗапроса.Пустой() Тогда

			ВыборкаАбоненты = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

		//	На текущий момент работаем по "верхней" выборке.
		//	Детализация по "ПрограммаЛояльности" на будущее..
		//	вдруг маркетингу взбрендит детализировать сообщение!

			Пока ВыборкаАбоненты.Следующий() Цикл
				
				ВыборкаСтроки = ВыборкаАбоненты.Выбрать();
				
				Пока ВыборкаСтроки.Следующий() Цикл

					Попытка
	
						Если ПроверитьСостояниеПоследовательности(ВыборкаСтроки.Контрагент) Тогда
							
							Если ВыборкаСтроки.ПрограммаЛояльностиТипБонусов = Перечисления.ТипыБонусов.Акционный Тогда

								ТекстСообщения	= СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
									  "Термін дії Ваших %1 акційних бонусів закінчується %2. Умови використання за посиланням https://old.antoshka.ua/ua/landing/page-20072023"
									, Формат(ВыборкаСтроки.СуммаАннуляции, "ЧДЦ=2; ЧРГ=; ЧН=0,00")
									, Формат(ВыборкаСтроки.Период, "ДФ=dd.MM.yyyy")
								);
								
							Иначе

								ТекстСообщения	= СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
									  "Термін дії Ваших %1 бонусів закінчується! Використуйте до '%2'"
									, Формат(ВыборкаСтроки.СуммаАннуляции, "ЧДЦ=2; ЧРГ=; ЧН=0,00")
									, Формат(ВыборкаСтроки.Период, "ДФ=dd.MM.yyyy")
								);
								
							КонецЕсли;
								
							Если ОтправитьОповещениеАннуляции(ВыборкаСтроки, ТекстСообщения, Отладка) Тогда
	
								ДанныеОповещения = Новый Структура(
									"НомерТелефона, ТекстСообщения, ДатаАннуляции"
									, ВыборкаСтроки.НомерТелефона
									, ТекстСообщения
									, Выборка.ДатаАннуляции
								);
								РегистрыСведений.ОповещенияКонтрагентов.Регистрация(ВыборкаСтроки.Контрагент
									, ПредопределенноеЗначение("Перечисление.ВидыОповещений.Аннуляция")
									, ДанныеОповещения
									, НачалоДня(ТекущаяДатаСеанса())
									, Отладка
								);
	
							КонецЕсли;
						
						КонецЕсли;
	
					Исключение
	
						ТекстОшибки = ОписаниеОшибки();
	
					КонецПопытки;

				КонецЦикла;

			КонецЦикла;

		КонецЕсли;

	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции	//	LNK 11.10.2022 05:59:17

//	LNK 26.06.2024 07:16:04
Функция ПроверитьСостояниеПоследовательности(Контрагент)

	ПараметрыЗапроса = Новый Структура(
		"ТипыБонусов, ТолькоТекущийОстаток, Команда"
		, ОбщегоНазначенияКлиентСервер.AAD(Перечисления.ТипыБонусов.Привлечение, Перечисления.ТипыБонусов.Органический, Перечисления.ТипыБонусов.Акционный)
		, Истина
		, "ОбщееСостояниеСчёта"
	);

	ДанныеОтвета = БонусныеБаллыСервер.BPS_ПолучитьОстатокБонусныхБаллов(Контрагент, ПараметрыЗапроса);

	Если ДанныеОтвета.Ошибка = Истина ИЛИ НЕ ДанныеОтвета.Свойство("ДанныеСчёта") Тогда

			ББ_ПоследовательностьВПорядке = Ложь;

	Иначе	ББ_ПоследовательностьВПорядке = (ДанныеОтвета.ДанныеСчёта.Регистратор_П = ДанныеОтвета.ДанныеСчёта.Регистратор_ГП);

	КонецЕсли;

	Возврат ББ_ПоследовательностьВПорядке;

КонецФункции

Функция ВыборкаАбонентовОповещения(ДатаАннуляции)

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ТаблицаСправочник.Код КАК Код,
	|	ТаблицаДанных.Контрагент КАК Контрагент,
	|	ТаблицаДанных.ПрограммаЛояльности КАК ПрограммаЛояльности,
	|	СУММА(ТаблицаДанных.СуммаАннуляции) КАК СуммаАннуляции,
	|	ТаблицаСправочник.Пол КАК Пол
	|ПОМЕСТИТЬ Аннуляция
	|ИЗ
	|	Справочник.Контрагенты КАК ТаблицаСправочник
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ТаблицаАннуляций.Контрагент КАК Контрагент,
	|			ТаблицаАннуляций.ПрограммаЛояльности КАК ПрограммаЛояльности,
	|			СУММА(ТаблицаАннуляций.СуммаБонусныхБаллов) КАК СуммаАннуляции
	|		ИЗ
	|			РегистрНакопления.БонусныеБаллы КАК ТаблицаАннуляций
	|		ГДЕ
	|			ТаблицаАннуляций.Период МЕЖДУ НАЧАЛОПЕРИОДА(&ДатаАннуляции, ДЕНЬ) И КОНЕЦПЕРИОДА(&ДатаАннуляции, ДЕНЬ)
	|			И ТаблицаАннуляций.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийБонусныхБаллов.Аннуляция)
	|		СГРУППИРОВАТЬ ПО
	|			ТаблицаАннуляций.Контрагент,
	|			ТаблицаАннуляций.ПрограммаЛояльности
	|
	|		ОБЪЕДИНИТЬ ВСЕ
	|
	|		ВЫБРАТЬ
	|			ТаблицаПоЗаказам.Контрагент,
	|			ТаблицаПоЗаказам.ПрограммаЛояльности,
	|			-ТаблицаПоЗаказам.СуммаБонусныхБалловОстаток
	|		ИЗ
	|			РегистрНакопления.БонусныеБаллыПоЗаказамПокупателей.Остатки(ДОБАВИТЬКДАТЕ(КОНЕЦПЕРИОДА(&ДатаАннуляции, ДЕНЬ),
	|				СЕКУНДА, 1),) КАК ТаблицаПоЗаказам
	|		ГДЕ
	|			ТаблицаПоЗаказам.СуммаБонусныхБалловОстаток > 0) КАК ТаблицаДанных
	|		ПО ТаблицаСправочник.Ссылка = ТаблицаДанных.Контрагент
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДанных.Контрагент,
	|	ТаблицаДанных.ПрограммаЛояльности,
	|	ТаблицаСправочник.Код,
	|	ТаблицаСправочник.Пол
	|ИМЕЮЩИЕ
	|	СУММА(ТаблицаДанных.СуммаАннуляции) >= 10
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Контрагент,
	|	ПрограммаЛояльности
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаВедущая.Контрагент КАК Контрагент,
	|	МАКСИМУМ(ТаблицаВедущая.Регистратор) КАК Регистратор_П,
	|	ТаблицаГраницы.Регистратор КАК Регистратор_ГП
	|ПОМЕСТИТЬ Границы
	|ИЗ
	|	(ВЫБРАТЬ
	|		ТаблицаРеестр.Контрагент КАК Контрагент,
	|		ТаблицаРеестр.Период КАК Период,
	|		МАКСИМУМ(ТаблицаРеестр.Регистратор) КАК Регистратор
	|	ИЗ
	|		Последовательность.СписаниеБонусныхПрограмм КАК ТаблицаРеестр
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|				ТаблицаПериоды.Контрагент КАК Контрагент,
	|				МАКСИМУМ(ТаблицаПериоды.Период) КАК Период
	|			ИЗ
	|				Аннуляция КАК Аннуляция
	|					ВНУТРЕННЕЕ СОЕДИНЕНИЕ Последовательность.СписаниеБонусныхПрограмм КАК ТаблицаПериоды
	|					ПО Аннуляция.Контрагент = ТаблицаПериоды.Контрагент
	|			СГРУППИРОВАТЬ ПО
	|				ТаблицаПериоды.Контрагент) КАК ТаблицаПериоды
	|			ПО ТаблицаРеестр.Контрагент = ТаблицаПериоды.Контрагент
	|			И ТаблицаРеестр.Период = ТаблицаПериоды.Период
	|	СГРУППИРОВАТЬ ПО
	|		ТаблицаРеестр.Контрагент,
	|		ТаблицаРеестр.Период) КАК ТаблицаВедущая
	|		ЛЕВОЕ СОЕДИНЕНИЕ Последовательность.СписаниеБонусныхПрограмм.Границы КАК ТаблицаГраницы
	|		ПО ТаблицаВедущая.Контрагент = ТаблицаГраницы.Контрагент
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаГраницы.Регистратор,
	|	ТаблицаВедущая.Контрагент
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Контрагент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&ДатаАннуляции КАК Период,
	|	Аннуляция.Контрагент КАК Контрагент,
	|	Аннуляция.ПрограммаЛояльности КАК ПрограммаЛояльности,
	|	Аннуляция.СуммаАннуляции КАК СуммаАннуляции,
	|	ТаблицаКонтакты.НомерТелефона КАК НомерТелефона,
	|	Аннуляция.Код КАК Код,
	|	Аннуляция.Пол КАК Пол,
	|	Аннуляция.ПрограммаЛояльности.ТипБонусов КАК ПрограммаЛояльностиТипБонусов
	|ИЗ
	|	Аннуляция КАК Аннуляция
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Границы КАК Границы
	|		ПО Аннуляция.Контрагент = Границы.Контрагент
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты.КонтактнаяИнформация КАК ТаблицаКонтакты
	|		ПО Аннуляция.Контрагент = ТаблицаКонтакты.Ссылка
	|		И ТаблицаКонтакты.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонКонтрагента)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОповещенияКонтрагентов КАК Фильтр
	|		ПО Аннуляция.Контрагент = Фильтр.Контрагент
	|		И Фильтр.ВидОповещения = ЗНАЧЕНИЕ(Перечисление.ВидыОповещений.Аннуляция)
	|		И Фильтр.ДатаАннуляции = &ДатаАннуляции
	|ГДЕ
	|	ВЫБОР
	|		КОГДА Границы.Регистратор_ГП = Границы.Регистратор_П
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ
	|	И Фильтр.Контрагент ЕСТЬ NULL
	|	И НЕ ТаблицаКонтакты.НомерТелефона = """"
	|
	|УПОРЯДОЧИТЬ ПО
	|	Код
	|ИТОГИ
	|	МАКСИМУМ(Период),
	|	КОЛИЧЕСТВО(ПрограммаЛояльности),
	|	СУММА(СуммаАннуляции),
	|	МАКСИМУМ(НомерТелефона),
	|	МАКСИМУМ(Код),
	|	МАКСИМУМ(Пол)
	|ПО
	|	Контрагент"
	);
	Запрос.УстановитьПараметр("ДатаАннуляции", ДатаАннуляции);
	
	Возврат Запрос.Выполнить();

КонецФункции

//	LNK 11.10.2022 08:08:26
Функция ОтправитьОповещениеАннуляции(ДанныеАбонента, ТекстСообщения, Отладка = Ложь)

	НомерТелефона	= ОтправкаSMS.ПодготовитьНомерТелефона(ДанныеАбонента.НомерТелефона);

	Если НЕ Отладка = Истина Тогда	//	LNK 25.06.2024 06:37:53

		Результат = ОтправкаSMS.ОтправитьSMS(ОбщегоНазначенияКлиентСервер.AAD(НомерТелефона)
					, ТекстСообщения
					,
					, Истина
			);
		ЗначениеВозврата = НЕ Результат.Ошибка;

	Иначе

		ЗначениеВозврата = Истина;

	КонецЕсли;

	Возврат ЗначениеВозврата;

КонецФункции

#КонецОбласти
